In [1]:
import pandas as pd

In [2]:
two_dimensional_list = [['A', 50,86], ['B', 89,31], ['C', 68,91], ['D', 88, 75]]

- np.array(two_dimensional_list)와 같게

In [3]:
my_df = pd.DataFrame(two_dimensional_list)
my_df

   0   1   2
0  A  50  86
1  B  89  31
2  C  68  91
3  D  88  75

In [4]:
type(my_df) #자료형

pandas.core.frame.DataFrame

In [6]:
my_df = pd.DataFrame(two_dimensional_list, 
                     columns=['name', 'english_score', 'math_score'],
                     index=[1,2,3,4])
my_df

  name  english_score  math_score
1    A             50          86
2    B             89          31
3    C             68          91
4    D             88          75

In [7]:
my_df.columns

Index(['name', 'english_score', 'math_score'], dtype='object')

In [8]:
my_df.index

Int64Index([1, 2, 3, 4], dtype='int64')

# -->dataframe 안에 다른 자료형이 있을 수 있음

In [10]:
my_df.dtypes

name             object
english_score     int64
math_score        int64
dtype: object

# 하지만 같은 컬럼 내에서는 모두 같은 자료형임

## - pandas의 dtype
**` 
int64	       정수
float64	      소수
object	       텍스트
bool	         불린(참과 거짓)
datetime64 	  날짜와 시간
category	     카테고리
`**